list = ['зима', 'весна', 'лето', 'осень']

dict = {1: 'зима', 2: 'зима', 12: 'зима',
        3: 'весна', 4: 'весна', 5: 'весна',
        6: 'лето', 7: 'лето', 8: 'лето',
        9: 'осень', 10: 'осень', 11: 'осень'}

user_m = int(input('Введите порядковый номер месяца: '))

# первый способ - через list
if user_m >= 3 and user_m <= 5:
    print('Время года', list[1])
elif user_m >= 6 and user_m <= 8:
    print('Время года', list[2])
elif user_m >= 9 and user_m <= 11:
    print('Время года', list[3])
else:
    print('Время года -', list[0])

# второй способ - через dict
print(dict[user_m])
